{
    "slug": "troubleshooting",
    "title": "Troubleshooting Common Web NFC Issues",
    "content": "<h3>Introduction</h3><p>Web NFC is a powerful but sometimes tricky API. If you're running into issues, this guide covers some of the most common problems and how to solve them.</p><h3>1. Error: \"Web NFC is not supported by this browser.\"</h3><p>This is the most common starting issue. For Web NFC to work, you must meet all of the following conditions:</p><ul><li><strong>Browser:</strong> You must be using <strong>Chrome on Android</strong>, version 89 or newer. It is not supported on iOS, desktop browsers, or other mobile browsers.</li><li><strong>Device:</strong> Your Android phone must have NFC hardware. Most modern mid-to-high-end phones do, but some budget models may not.</li><li><strong>Secure Context (HTTPS):</strong> Your website must be served over <strong>HTTPS</strong>. The API will not work on `http://` sites or local files.</li></ul><h3>2. Scanning or Writing Doesn't Start</h3><p>If you click a button and nothing happens, check the following:</p><ul><li><strong>User Gesture:</strong> Web NFC actions like `scan()` or `write()` must be triggered by a direct user action, like a click. You cannot start a scan automatically on page load.</li><li><strong>NFC is Disabled on Phone:</strong> Go to your Android settings (usually in 'Connected devices' or by pulling down the notification shade) and ensure that NFC is turned on.</li><li><strong>Console Errors:</strong> Check the developer console in Chrome for any specific error messages that could give you a clue.</li></ul><h3>3. Nothing Happens When Tapping the Tag</h3><p>You've started a scan, the browser prompt is showing, but tapping the tag does nothing. Try these steps:</p><ul><li><strong>Find the Sweet Spot:</strong> The NFC antenna's location varies on every phone. It's usually on the back, near the top or center. Move the tag slowly around the back of your phone to find the spot where it gets detected.</li><li><strong>Remove Phone Case:</strong> Thick or metallic phone cases can block the NFC signal. Try removing your case and scanning again.</li><li><strong>Tag Type:</strong> Ensure you are using a standard, NDEF-formatted NFC tag. Some proprietary tags or access cards may not be compatible with Web NFC.</li></ul><h3>4. Error: \"Tag is not writable\" or \"Tag is read-only\"</h3><p>This error is straightforward. The NFC tag you are trying to write to has been permanently locked. Once a tag is made read-only, this action is irreversible. You will need a new, writable tag.</p><h3>5. Error: \"GATT operation failed for unknown reason.\"</h3><p>This is a generic error that can sometimes occur. It often means there was a temporary glitch in the communication between the phone and the tag. The best solution is often to simply try the operation again.</p>"
}